       IDENTIFICATION DIVISION.
       PROGRAM-ID. operationsRoutinsDylanThomas.
       AUTHOR. NATALIA CALVO.
       INSTALLATION. GIJON.
       DATE-WRITTEN. MAY 03, 2023.
       DATE-COMPILED.
       SECURITY. UNCLASSIFIED.

       DATA DIVISION.

       FILE SECTION.
       
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
       ROUTIN01.
           DISPLAY "Never until the mankind making"
           PERFORM ROUTIN03.
       ROUTIN02.
           DISPLAY "Fathering and all humbling darkness"
           PERFORM ROUTIN05.
       ROUTIN03.
           DISPLAY "Bird beast and flower"
           PERFORM ROUTIN02.
       ROUTIN04.
           DISPLAY "And the still hour"
           PERFORM ROTIN06.
       ROUTIN05.
           DISPLAY "Tells with silence the last light breaking"
           PERFORM ROUTIN04.
       ROUTIN06.
           DISPLAY "Is come of the sea tumbling in harness."
           STOP RUN.
       END PROGRAM operationsRoutinsDylanThomas.
